Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: The end result of the above configuration would be the following `env` part being applied the generated `Deployment`:
es_es: El resultado final de la configuración anterior sería la siguiente `env` parte que se aplica el `Deployment` generado:

source: The entry point must always be set to `io.quarkus.gcp.functions.http.QuarkusHttpFunction` as this is the class that integrates Cloud Functions with Quarkus.
es_es: El punto de entrada debe ser siempre `io.quarkus.gcp.functions.http.QuarkusHttpFunction` ya que esta es la clase que integra las Funciones Cloud con Quarkus.

source: The exact configuration is:
es_es: La configuración exacta es:

source: The exhaustive list of parameters can be found in https://github.com/upx/upx/blob/devel/doc/upx.pod[the UPX documentation].
es_es: La lista completa de parámetros se encuentra en https://github.com/upx/upx/blob/devel/doc/upx.pod[la documentación de UPX].

source: The existing API had design flaws that wouldn’t have been easy to fix, so we were considering replacing it with a new implementation. Our small team had more experience in JVM languages than JavaScript, and since this was an API serving Java data, we thought eating our own dogfood would be a good thing!
es_es: La API existente tenía fallos de diseño que no habrían sido fáciles de arreglar, así que nos planteamos sustituirla por una nueva implementación. Nuestro pequeño equipo tenía más experiencia en lenguajes JVM que en JavaScript, y como se trataba de una API que servía datos de Java, pensamos que comer nuestra propia comida para perros sería algo bueno!

source: The extension `quarkus-container-image-docker` is using the Docker binary and the generated Dockerfiles under `src/main/docker` in order to perform Docker builds.
es_es: La extensión `quarkus-container-image-docker` utiliza el binario Docker y los archivos Docker generados bajo `src/main/docker` para realizar las construcciones Docker.

source: The extension is disabled by default in order to prevent the application for making API calls when it is not running in a Kubernetes environment. To enable it, set `quarkus.kubernetes-config.enabled=true` (for example using a specific xref:config-reference.adoc#profiles[profile]).
es_es: La extensión está desactivada por defecto para evitar que la aplicación realice llamadas a la API cuando no se ejecuta en un entorno Kubernetes. Para habilitarla, configure `quarkus.kubernetes-config.enabled=true` (por ejemplo, utilizando un xref:config-reference.html#profiles[perfil] específico).

source: The extension understands the following types of ConfigMaps and Secrets as input sources:
es_es: La extensión entiende los siguientes tipos de ConfigMaps y Secretos como fuentes de entrada:

source: The extension works by reading ConfigMaps and Secrets directly from the Kubernetes API server using the xref:kubernetes-client.adoc[Kubernetes Client].
es_es: La extensión funciona leyendo ConfigMaps y Secretos directamente desde el servidor de la API de Kubernetes utilizando el xref:kubernetes-client.html[Cliente Kubernetes].

source: The first function we'll look at is `defaultChain`.
es_es: La primera función que veremos es `defaultChain`.

source: The first time you launch this command, you can have the following error message:
es_es: La primera vez que se lanza este comando, puede aparecer el siguiente mensaje de error:

source: The following IDEs have support for the community developed Quarkus Tools:
es_es: Los siguientes IDEs tienen soporte para las herramientas Quarkus desarrolladas por la comunidad:

source: The following example changes the `quarkus.datasource.db-kind` to `mysql`. For this to work the `mysql-extension` must have been included in the build. Augmentation can only use extensions that were present during compile time.
es_es: El siguiente ejemplo cambia el `quarkus.datasource.db-kind` por `mysql`. Para que esto funcione el `mysql-extension` debe haber sido incluido en la compilación. La ampliación sólo puede utilizar las extensiones que estaban presentes en el momento de la compilación.

source: The following example creates a topic named `test` with 3 partitions, and a second topic named `messages` with 2 partitions.
es_es: El siguiente ejemplo crea un tema llamado `test` con 3 particiones, y un segundo tema llamado `messages` con 2 particiones.

source: The following is an example application.properties file section illustrating the embedded realm configuration:
es_es: A continuación se muestra una sección del archivo application.properties de ejemplo que ilustra la configuración del ámbito integrado:

source: The following is an example for the `{config-file}` file:
es_es: El siguiente es un ejemplo para el archivo `{config-file}`:

source: The following properties can be used to customize the container image build process.
es_es: Las siguientes propiedades pueden utilizarse para personalizar el proceso de construcción de la imagen del contenedor.

source: The format for durations uses the standard `java.time.Duration` format. You can learn more about it in the link:https://docs.oracle.com/javase/8/docs/api/java/time/Duration.html#parse-java.lang.CharSequence-[Duration#parse() javadoc].
es_es: El formato de las duraciones utiliza el formato estándar `java.time.Duration`. Puede obtener más información al respecto en link:https://docs.oracle.com/javase/8/docs/api/java/time/Duration.html#parse-java.lang.CharSequence-[Duration#parse() javadoc].

source: The gRPC Reflection Service is enabled in dev mode by default. That lets you use tools such as `grpcurl`. In production mode, the reflection service is disabled. You can enable it explicitly using `quarkus.grpc-server.enable-reflection-service=true`.
es_es: El servicio gRPC Reflection está activado por defecto en el modo dev. Esto le permite utilizar herramientas como `grpcurl`. En el modo de producción, el servicio de reflexión está desactivado. Puedes habilitarlo explícitamente usando `quarkus.grpc-server.enable-reflection-service=true`.

source: The guide assumes that you have the https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI] installed.
es_es: La guía asume que tienes la https://devcenter.heroku.com/articles/heroku-cli[CLI de Heroku] instalada.

source: The idea behind the notion of the conditional dependency is that such a dependency must be activated only if a certain condition is satisfied. If the condition is not satisfied then the dependency **must not** be activated. In that regard, conditional dependencies can be categorized as optional, i.e. they may or may not appear in the resulting set of project dependencies.
es_es: La idea que subyace a la noción de dependencia condicional es que dicha dependencia debe activarse sólo si se cumple una determinada condición. Si la condición no se cumple, la dependencia **no debe** activarse. En este sentido, las relaciones condicionales pueden clasificarse como opcionales, es decir, pueden aparecer o no en el conjunto resultante de relaciones del proyecto.

source: The interval in second between two reconnection attempts Type: _int_
es_es: El intervalo en segundos entre dos intentos de reconexión Type: _int_

source: The lead developer on the Technical Steering Committee responsible for the upkeep of the API explains:
es_es: El desarrollador principal del Comité Directivo Técnico responsable del mantenimiento de la API explica:

source: The live coding fast feedback loop was very useful when developing with Quarkus. Although fast startup was nice, it wasn’t critical since our apps are long-running, but during development, as we tweaked our APIs, being able to immediately re-test saved us a ton of development time.
es_es: El bucle de retroalimentación rápida de la codificación en vivo fue muy útil al desarrollar con Quarkus. Aunque el inicio rápido era bueno, no era crítico ya que nuestras aplicaciones son de larga duración, pero durante el desarrollo, a medida que ajustábamos nuestras APIs, el poder volver a probar inmediatamente nos ahorró una tonelada de tiempo de desarrollo.

source: The max number of seconds to wait to determine if the connection with the broker is still established for the readiness check. After that threshold, the check is considered as failed. Type: _int_
es_es: El número máximo de segundos que hay que esperar para determinar si la conexión con el corredor sigue establecida para la comprobación de disponibilidad. Después de ese umbral, la comprobación se considera fallida. Type: _int_

source: The mission of the Eclipse Adoptium Top-Level Project is to produce high-quality runtimes and associated technology for use within the Java ecosystem. Eclipse Adoptium also provides artifacts including open-source infrastructure as code, a comprehensive continuous integration build and test farm, and extensive quality assurance tests. These artifacts may be used by Eclipse Adoptium projects and other runtime technology builders to ensure the provision of secure, Java SE TCK-tested and compliant, production-ready runtimes.
es_es: La misión del proyecto de alto nivel Eclipse Adoptium es producir tiempos de ejecución de alta calidad y tecnología asociada para su uso dentro del ecosistema Java. Eclipse Adoptium también proporciona artefactos que incluyen la infraestructura de código abierto como código, una completa granja de construcción y pruebas de integración continua, y extensas pruebas de garantía de calidad. Estos artefactos pueden ser utilizados por los proyectos de Eclipse Adoptium y otros creadores de tecnología de tiempo de ejecución para garantizar la provisión de tiempos de ejecución seguros, probados y compatibles con el TCK de Java y listos para la producción.

source: The name of the AMQP Client Option bean used to customize the AMQP client configuration Type: _string_
es_es: El nombre del grano de opción del cliente AMQP utilizado para personalizar la configuración del cliente AMQP Type: _string_

source: The name of the link. If not set, the channel name is used. Type: _string_
es_es: El nombre del enlace. Si no se establece, se utiliza el nombre del canal. Type: _string_

source: The native executable must be referenced as `runner` if you include a custom `bootstrap` script.
es_es: El ejecutable nativo debe ser referenciado como `runner` si incluye un script personalizado de `bootstrap`.

source: The native image can also be locally tested using the `sam.native.yaml` template:
es_es: La imagen nativa también puede probarse localmente utilizando la plantilla `sam.native.yaml`:

source: The number of reconnection attempts Type: _int_
es_es: El número de intentos de reconexión Type: _int_

source: The one current restriction is that extensions should work in both OpenJDK and GraalVM native executables. That is the guarantee we give Quarkus users (a cross compilation for their app). We have a maturity model to improve an extension to be fully "Quarked" and benefit from Quarkus, all done in incremental steps. Just hop on our https://quarkus.io/community/#discussions[mailing list] to discuss your ideas and get help. And you can start reading our https://quarkus.io/guides/writing-extensions[Writing extensions guide] as well or more simply get inspiration from the https://github.com/quarkusio/quarkus/tree/main/extensions[existing ones].
es_es: La limitación actual es que las extensiones deben funcionar con los ejecutables nativos de OpenJDK y GraalVM. Esta es una garantía que brindamos a los usuarios de Quarkus (compilación cruzada de aplicaciones). Tenemos un modelo de madurez para mejorar una extensión para que sea completamente "Quarked" y beneficiarse de Quarkus, todo hecho en pasos incrementales. Visite https://quarkus.io/community/#discussions[nuestra lista de correo] para discutir ideas y obtener apoyo. También puede comenzar a leer https://quarkus.io/guides/writing-extensions[guía sobre crear extensiones] o puede inspirarse en https://github.com/quarkusio/quarkus/tree/main/extensions[alguna de las existentes].

source: The out-of-the-box performance of Quarkus on JVM exceeded their expectations quite easily:
es_es: El rendimiento inmediato de Quarkus en JVM superó sus expectativas con bastante facilidad:

source: The password used to authenticate to the broker Type: _string_
es_es: La contraseña utilizada para autenticarse en el broker Type: _string_

source: The payload is converted to JSON (using a Json Mapper). The result is wrapped into AMQP Data using a **binary** content. The `content-type` is set to `application/json`
es_es: La carga útil se convierte en JSON (utilizando un mapeador Json). El resultado se envuelve en AMQP Data usando un contenido *binario*. El `content-type` se establece en `application/json`

source: The period (in milliseconds) between two attempts to retrieve the credits granted by the broker. This time is used when the sender run out of credits. Type: _int_
es_es: El período (en milisegundos) entre dos intentos de recuperar los créditos concedidos por el corredor. Este tiempo se utiliza cuando el emisor se queda sin créditos. Type: _int_

source: The properties obtained from the ConfigMaps and Secrets have a higher priority than (i.e. they override) any properties of the same name that are found in `application.properties` (or the YAML equivalents), but they have lower priority than properties set via Environment Variables or Java System Properties.
es_es: Las propiedades obtenidas a partir de los ConfigMaps y Secretos tienen mayor prioridad que (es decir, anulan) cualquier propiedad del mismo nombre que se encuentre en `application.properties` (o los equivalentes en YAML), pero tienen menor prioridad que las propiedades establecidas a través de Variables de Entorno o Propiedades del Sistema Java.

source: The repository type to store JBeret and Job data. A jdbc type requires a JDBC datasource.
es_es: El tipo de repositorio para almacenar los datos de JBeret y Job. Un tipo jdbc requiere una fuente de datos JDBC.

source: The result should be: `Hello world` as it is the value obtained from the Spring Cloud Config server.
es_es: El resultado debe ser: `Hello world` ya que es el valor obtenido del servidor Spring Cloud Config.

source: The second application, the `processor`, in turn, will read from the `quote-requests` queue put a random price to the quote, and send it to a queue named `quotes`.
es_es: La segunda aplicación, la `processor`, a su vez, leerá de la cola `quote-requests` poner un precio aleatorio a la cotización, y lo enviará a una cola llamada `quotes`.

source: The sheer volume of AdoptOpenJDK downloads, https://dash.adoptopenjdk.net/trends[about 500,000 per day^], meant that performance would become a key consideration for the API. In addition, Adoptium does not have a traditional datacenter, so all of this runs in the cloud on Microsoft Azure, where costs can increase when you have continuously running workloads that take up unnecessary space.
es_es: El gran volumen de descargas de AdoptOpenJDK, https://dash.adoptopenjdk.net/trends[unas 500.000 al día^], significaba que el rendimiento se convertiría en una consideración clave para la API. Además, Adoptium no tiene un centro de datos tradicional, por lo que todo esto se ejecuta en la nube en Microsoft Azure, donde los costes pueden aumentar cuando se tienen cargas de trabajo en ejecución continua que ocupan un espacio innecesario.

source: The simplest way to start this container in the cloud is with the Azure Container Instances service. It simply creates a container on Azure infrastructure.
es_es: La forma más sencilla de iniciar este contenedor en la nube es con el servicio Azure Container Instances. Simplemente crea un contenedor en la infraestructura de Azure.

source: The solution is located in the `funqy-google-cloud-functions-http-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-google-cloud-functions-http-quickstart[directory].
es_es: La solución se encuentra en `funqy-google-cloud-functions-http-quickstart` link:{quickstarts-tree-url}/funqy-quickstarts/funqy-google-cloud-functions-http-quickstart[directorio].

source: The source code is hosted on <a href="https://github.com/quarkusio/quarkus">GitHub</a>. If you need to report a bug or request a new feature, look for a similar one on our <a href="https://github.com/quarkusio/quarkus/issues">GitHub issue tracker</a>. If you don’t find any, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">create a new issue</a>.
es_es: El código fuente está alojado en <a href="https://github.com/quarkusio/quarkus">GitHub</a>. Si necesitas informar de un error o solicitar una nueva función, busca uno similar en nuestro <a href="https://github.com/quarkusio/quarkus/issues">Rastreador de problemas de GitHub</a>;. Si no encuentras ninguno, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">crea una nueva incidencia</a>.

source: The table below gives an overview of the current IDEs with links and a high-level overview of their features.
es_es: La siguiente tabla ofrece una visión general de los IDEs actuales con enlaces y una visión general de sus características.

source: The use of the `quarkus-kubernetes-config` extensions is completely optional as there are other ways an application can be configured to use ConfigMaps or Secrets.
es_es: El uso de las extensiones de `quarkus-kubernetes-config` es completamente opcional, ya que existen otras formas de configurar una aplicación para que utilice ConfigMaps o Secrets.

source: The user, `alice`, has `alice` as their password and `admin` as their role.
es_es: El usuario, `alice`, tiene como contraseña `alice` y como rol `admin`.

source: The user, `bob`, has `bob` as their password and `user` as their role.
es_es: El usuario, `bob`, tiene como contraseña `bob` y como rol `user`.

source: The username used to authenticate to the broker Type: _string_
es_es: El nombre de usuario utilizado para autenticarse en el broker Type: _string_

source: The values above allow the application to be completely agnostic of the actual database configuration used in production while also not inhibiting the usability of the application at development time.
es_es: Los valores anteriores permiten que la aplicación sea completamente agnóstica con respecto a la configuración de la base de datos real utilizada en producción, al tiempo que no inhibe la usabilidad de la aplicación en tiempo de desarrollo.

source: Then check that the endpoint returns `hello quarkus` as expected:
es_es: A continuación, compruebe que el endpoint devuelve `hello quarkus` como se esperaba:

source: Then you can create the ACR:
es_es: A continuación, puede crear el ACR:

source: Then you can use it to launch your function locally.
es_es: A continuación, puede utilizarlo para lanzar su función localmente.

source: Then you will be able to use `gcloud` to deploy your function to Google Cloud.
es_es: A continuación, podrá utilizar `gcloud` para desplegar su función en Google Cloud.

source: Then, in your application configuration, enable the compression by configuring the _compression level_ you want:
es_es: A continuación, en la configuración de su aplicación, active la compresión configurando el _nivel de compresión_ que desee:

source: Then, you can reconstruct the instance using the `mapTo` method
es_es: A continuación, puede reconstruir la instancia utilizando el método `mapTo`

source: There are 2 `@Blocking` annotations:
es_es: Hay 2 anotaciones en `@Blocking`:

source: There are always new users trying to get started quickly. Share your experience with everyone by writing a Quickstart and submitting it for peer review.
es_es: Siempre hay nuevos usuarios que intentan empezar rápidamente. Comparte tu experiencia con todos escribiendo un Quickstart y enviándolo para que lo revisen otros usuarios.

source: There are cases where the built container image may need to have Java debugging conditionally enabled at runtime.
es_es: Hay casos en los que la imagen del contenedor construido puede necesitar tener la depuración de Java condicionada en tiempo de ejecución.

source: There are different approaches for using ACI. Check the documentation for details. The quickest way to get a container up and running goes as it follows.
es_es: Existen diferentes enfoques para utilizar ACI. Consulte la documentación para obtener más detalles. La forma más rápida de poner en marcha un contenedor es la siguiente.

source: There are heaps of helpful <a href="{{site.baseurl}}/publications">articles and blog posts</a> out there presenting interesting use-cases and examples of Quarkus in action.
es_es: Hay un montón de útiles <a href="{{site.baseurl}}/publications">artículos y entradas de blog</a> que presentan interesantes casos de uso y ejemplos de Quarkus en acción.

source: There's a trigger YAML file for each of our 4 Funqy functions. Deploy them all:
es_es: Hay un archivo YAML de activación para cada una de nuestras 4 funciones Funqy. Despliégalos todos:

source: These are explained below:
es_es: Se explican a continuación:

source: These materials are for JUGs who have tour dates booked and want access to promotional materials to use to create excitement and drum up attendance. We've written a couple versions of the session abstracts so you could find one that fits your JUGs personality, or go for it and create your own! We've also created some <a href="{{site.baseurl}}/worldtour/graphics">graphic resources</a> for social promotions a well.
es_es: Estos materiales son para los JUGs que tienen fechas reservadas y quieren tener acceso a materiales promocionales para crear expectación y aumentar la asistencia. Hemos redactado un par de versiones de los resúmenes de las sesiones para que encuentres la que mejor se adapte a la personalidad de tu JUG, ¡o crea la tuya propia! También hemos creado algunos <a href="{{site.baseurl}}/worldtour/graphics">recursos gráficos</a> para promociones sociales.

source: Think of Quarkus extensions as your project dependencies. Extensions configure, boot and integrate a framework or technology into your Quarkus application. They also do all of the heavy lifting of providing the right information to GraalVM for your application to compile natively. This will allow 3rd party projects to easily take advantage of the work we have done to make it easier to target GraalVM.
es_es: Piense en las extensiones de Quarkus como dependencias de su proyecto. Las extensiones configuran, arrancan e integran un framework o tecnologías en su aplicación de Quarkus. También hacen todo el trabajo pesado de proporcionar la información correcta a GraalVM para que su aplicación se compile de forma nativa. Esto permite que los proyectos de terceros aprovechen fácilmente el trabajo que hemos realizado para que sea más fácil utilizar GraalVM.

source: This auto-attachment can be disabled using:
es_es: Esta autoadhesión se puede desactivar mediante:

source: This command creates the project structure and select the two Quarkus extensions we will be using:
es_es: Este comando crea la estructura del proyecto y selecciona las dos extensiones de Quarkus que vamos a utilizar:

source: This command generates a project which imports the `spring-cloud-config-client` extension.
es_es: Este comando genera un proyecto que importa la extensión `spring-cloud-config-client`.

source: This command will give you as output a `httpsTrigger.url` that points to your function.
es_es: Este comando le dará como salida un `httpsTrigger.url` que apunta a su función.

source: This document describes how to test Quarkus Security.
es_es: Este documento describe cómo probar Quarkus Security.

source: This guide also covers the testing of the endpoint.
es_es: Esta guía también cubre las pruebas del endpoint.
